In [5]:
import urllib.request
from urllib.error import HTTPError,URLError
from bs4 import BeautifulSoup
import random
import time
from urllib import parse

In [3]:
# Hearder that use to crawl
url=r'http://software77.net/geo-ip/history/'
Headers = { \
    'accept': 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8', \
    'accept-language': 'en-US,en;q=0.9,fr;q=0.8,ro;q=0.7,ru;q=0.6,la;q=0.5,pt;q=0.4,de;q=0.3', \
    'cache-control': 'max-age=0', \
    'upgrade-insecure-requests': '1', \
    'user-agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_13_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/67.0.3396.99 Safari/537.36' \
    }

In [157]:
# Crawl the  page of  all iptable list
req = urllib.request.Request(url, headers=Headers)
response = urllib.request.urlopen(req)
content = BeautifulSoup(response.read(), "html.parser")
result = content.find_all("a")

In [158]:
# Find out the latest ip_table
for i in range(len(result)):
    if len(result[-(i+1)].text)==29:
        lastfilename=result[-(i+1)].text
        break
lastfilename

'IpToCountry.1588999259.csv.gz'

In [160]:
finalurl=url+lastfilename

In [161]:
finalurl

'http://software77.net/geo-ip/history/IpToCountry.1588999259.csv.gz'

In [12]:
# Download  the latest iptable
ipfile =urllib.request.urlretrieve(finalurl, "iptable.gz")

In [154]:
# Unzip the file into a csv file
import gzip
g_file = gzip.GzipFile('iptable.gz')
open('IpToCountry.csv', "wb+").write(g_file.read())
g_file.close()

In [155]:
# Read the file we just unzipped
import pandas as pd
ip_to_country=pd.read_csv (r'IpToCountry.csv',skiprows=340,header=None)
ip_to_country.columns=['IPFROM','IPTO','REGISTRY','ASSIGNED','CTRY','CNTRY','COUNTRY']

In [156]:
ip_to_country

            IPFROM        IPTO REGISTRY    ASSIGNED CTRY CNTRY    COUNTRY
0         16843776    16844799    apnic  1302739200   CN   CHN      China
1         16844800    16845055    apnic  1302566400   CN   CHN      China
2         16845056    16845311    apnic  1302566400   CN   CHN      China
3         16845312    16845823    apnic  1302566400   CN   CHN      China
4         16845824    16846847    apnic  1302566400   CN   CHN      China
...            ...         ...      ...         ...  ...   ...        ...
213274  3758093312  3758094335    apnic  1280880000   IN   IND      India
213275  3758094336  3758095359    apnic  1446681600   HK   HKG  Hong Kong
213276  3758095360  3758095871    apnic  1302739200   CN   CHN      China
213277  3758095872  3758096127    apnic  1302220800   SG   SGP  Singapore
213278  3758096128  3758096383    apnic  1313020800   AU   AUS  Australia

[213279 rows x 7 columns]

In [46]:
user_ip=pd.read_csv('user_ip_table.csv')

In [47]:
user_ip

     userid      ip_address
0        69     24.67.58.89
1       186   71.166.58.179
2       304   98.110.167.20
3       501   1.125.110.203
4       589   174.241.3.153
..      ...             ...
995   80503  107.77.192.131
996   80709   94.69.207.203
997   80967  197.153.152.87
998   81119  71.214.238.198
999   81341    76.236.28.10

[1000 rows x 2 columns]

In [48]:
# Transfer the ip list into an int list
ip_address_int=user_ip.ip_address.map(lambda x:sum([256**j*int(i) for j,i in enumerate(x.split('.')[::-1])]))
user_ip['ip_address_int']=ip_address_int

In [49]:
user_ip

     userid      ip_address  ip_address_int
0        69     24.67.58.89       407059033
1       186   71.166.58.179      1202076339
2       304   98.110.167.20      1651418900
3       501   1.125.110.203        24997579
4       589   174.241.3.153      2935030681
..      ...             ...             ...
995   80503  107.77.192.131      1800257667
996   80709   94.69.207.203      1581633483
997   80967  197.153.152.87      3315177559
998   81119  71.214.238.198      1205268166
999   81341    76.236.28.10      1290542090

[1000 rows x 3 columns]

In [63]:
# Create Mysql Connection
import pymysql
import sqlalchemy as sql
engine = sql.create_engine('mysql+pymysql://root:dameng123@localhost:3306/interview')

In [71]:
# Save the user_ip table into mysql
pd.io.sql.to_sql(user_ip, 'user_ip', con=engine, index=False, if_exists='replace')

In [72]:
# Save the ip_to_country table into mysql
pd.io.sql.to_sql(ip_to_country, 'ip_to_country', con=engine, index=False, if_exists='replace')

In [88]:
# Join two tables
query="select a.userid,a.ip_address,b.country from user_ip  a left join ip_to_country b on a.ip_address_int<b.IPTO and a.ip_address_int>b.IPFROM"
user_with_country=pd.read_sql_query(query,engine)

In [89]:
user_with_country

     userid       ip_address        country
0      8745       1.75.9.174          Japan
1     18284        1.75.8.34          Japan
2      9570     1.75.198.137          Japan
3       501    1.125.110.203      Australia
4     27770    1.136.104.103      Australia
..      ...              ...            ...
995     599   216.186.242.61  United States
996   19009   219.100.55.195          Japan
997   91188  219.160.135.194          Japan
998   48179    219.167.20.50          Japan
999  108182    222.14.44.206          Japan

[1000 rows x 3 columns]

In [90]:
# Save the user_with_country table into database
pd.io.sql.to_sql(user_with_country, 'user_with_country', con=engine, index=False, if_exists='replace')

In [151]:
# Data Distribution Validation 
query="select * from (select * from (select count(userid) NUM ,country from user_with_country group by country order by NUM desc) TMP \
limit 10) TMP2 \
union all \
select count(userid) as NUM ,'Other' as 'Country' from user_with_country where country not in ( \
select country from (select country from \
(select count(userid) NUM ,country from user_with_country group by country order by NUM desc) TMP3 \
limit 10)TMP4) "
user_distribution=pd.read_sql_query(query,engine)

In [152]:
user_distribution

    NUM         country
0   574   United States
1    95  United Kingdom
2    69          France
3    58          Canada
4    37           Japan
5    22           Spain
6    20       Australia
7    13         Ireland
8    12         Germany
9    12     Netherlands
10   88           Other